[metadata]
creation_date = "2024/03/15"
updated_date = "2024/11/01"
maturity = "production"

[rule]
name = "Minimal EQL Test Rule"
rule_id = "00000000-0000-0000-0000-000000000001"
severity = "medium"
type = "eql"
language = "eql"

query = "process where event.action == \"start\""

[[rule.threat]]
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
